package com.lyl.mybatis_demo.utils;

import java.util.Random;

/**
 * @author 罗亚龙
 * @date 2021/10/27 10:20
 */
public class MockUtil {
    private static final String SUR_NAME = "丁,范,圆,万,程,阎,夏,唐,易,崔,吕,漕,刘,张,蔡,谢,萧,谭,田,朱,吴,戴,常,尹,贺,贾,陆,陈,李,魏,乔,孔,何,赖,罗,潘,孙,余,杜,江,孟,卢,董,汤,武,杨,周,汪,马,彭,赵,白,顾,岁,梁,袁,傅,文,沈,熊,王,宋,蒋,于,徐,邓,林,龙,龚,薛,钟,冯,侯,邱,钱,段,邵,康,许,方,邹,黄,黎,苏,郑,金,廖,高,姚,毛,姜,郝,胡,秦,注,韩,郭,史,石,叶,曹,任,曾";
    private static final String BOY_NAME = "健柏,安平,德惠,修为,永元,合,选,志泽,高翰,栋,睿达,正真,树,民,琒,睿德,向明,绍元,君,开朗,思,鸿云,倡,兴朝,振海,乐山,琩,含,伟彦,琮,英锐,俊雄,琳,睿诚,逸,琸,俊人,景铄,志用,俊拔,绍祺,向阳,才哲,汉,和歌,新翰,修平,经赋,昊天,泰华,汗,哲茂,和正,健,嘉慕,桦,恩,豪,昊焱,鑫,恬,嘉赐,俊英,睿思,俊茂,温文,荣轩,和安,豹,彭湃,敏叡,偿,颁,天和,炎彬,伟诚,宏义,智志,频,英奕,颔,信瑞,咏歌,和宜,琪睿,修雅,茂材,璟,意远,钢,英喆,项明,钧,碧,文赋,明哲,鹏天,岩,波光,碫,欣荣,心思,鲲,河,嘉禧,子明,飞跃,乐意,邶,俊弼,正德,锐达,哲彦,修竹,华晖,鸿振,兴德,磊,茂实,擎,铎,飒,浩大,俊彦,铖,僖,飚,永嘉,德馨,乐贤,飞,永春,棠,铠,波,凯泽,承安,鸿卓,安歌,部,壮,森,泰,康裕,永丰,升荣,飞昂,铸,峻,逸春,泽,铿,嘉致,星华,和通,崇,锋,康胜,飞舟,儒,黎明,安宁,飞星,阳飙,志专,鸿彩,蔚,鹏海,嘉懿,恺乐,飞航,和怡,元明,巍奕,兴思,俊德,修齐,凯唱,子平,奇文,元嘉,浩浩,鸿宝,阳夏,键,高峻,浩涆,飞鸿,明喆,俊迈,贵,阳泽,高洁,弘光,示,德明,承运,康复,弘济,俊达,政,立人,飞驰,元,君昊,镇,先,光,煊,鸿德,克,阳焱,鸿羽,欣怡,雨伯,和豫,奕,宏茂,俊远,祚,飞扬,楠,博超,宏朗,弘文,祥,襦,全,鸿志,学名,欣怿,自明,兴,畴,光熙,烨煜,宏伟,星辰,高畅,腾,嘉平,冀,玉韵,修德,玉石,善,禅,奇致,元良,俊名,博涛,嘉良,斌,俊民,妍,高兴,鹏程,福,和璧,冕,榕,嘉庆,玉堂,馗,刚豪,榜,温纶,涵蓄,振国,浩旷,安民,坚秉,玉树,睿慈,彭彭,逸仙,经纬,涵,烨熠,凯旋,昊乾,弘量,锐精,浩淼,元亮,和裕,元纬,凌,鹏鹍,才良,淏,华彩,飞雨,鹏举,川,文虹,巍昂,州,华荣,乐游,凡,巡,冠玉,日,嘉勋,锐锋,和惬,雨信,弘懿,天路,旭,永望,和泰,光明,翰翮,华辉,立轩,良平,英纵,致,旷,力夫,和泽,闻,函,言,光临,乐湛,帅,清,成业,玉山,嘉,同和,昊,渊,承悦,昌,德曜,伟兆,明,昊苍,嘉茂,易,康时,昕,丕,世,列,战,阳州,则,安顺,刚,毅然,东,舜,思源,星,华容,英范,宏远,利,航,祺瑞,昊英,理全,刚洁,阳舒,鹏云,康成,子安,和畅,昴,元化,高昂,文曜,稹,翔宇,稼,涵畅,立果,鸿,晁,子实,穆,瀚漠,高阳,正奇,义,凯乐,晋,之,才,鹏,乐,雅健,乒,宜年,乔,弘扬,晗日,乐人,飞龙,博艺,光誉,正浩,建业,马,英华,良,天骄,鹰,平,宾白,高爽,经武,俊能,驹,天空,智,飞宇,鸿风,乾,承,英彦,英武,承天,庆,元武,元正,光亮,骏,鸿波,源,阳晖,英博,兴文,玉泽,庚,乐童,暠,博雅,溢,璞玉,雅惠,助,嘉玉,宏硕,庭,劭,苑杰,文彦,成益,同光,康,苑博,成仁,势,仁,雄,嘉许,明朗,才捷,高芬,勇,弘盛,盈,文彬,永寿,子民,益,勋,彬炳,绍,黎,子琪,敏才,光霁,勒,仓,华池,勘,修洁,盛,俊楠,仞,代,嘉志,英毅,若,竦,飞尘,永思,绮,端,拯,勰,鸿畅,景辉,延,元忠,鸿煊,景澄,建,华灿,任,文林,修贤,承福,英达,国,翰飞,高雅,嘉石,修然,鸿祯,鸿畴,兴言,涵映,星光,霆,子瑜,锐利,伋,兴旺,弘伟,永逸,英发,才俊,浩荡,朕,正初,茗,众,泰清,阳曜,浩博,伟晔,缜,伟,真,烨霖,泰初,嘉树,弢,勇锐,圣,祺祥,同方,欧,弩,嘉谊,兴业,安福,振,元思,雅畅,自珍,越彬,朴,英韶,锐阵,皓轩,伸,挺,英耀,泰鸿,星文,承嗣,兴为,阳伯,魏,子,德水,佑,子墨,阳朔,修文,卓,文耀,策,志行,博,孜,温瑜,乐容,坤,建木,武,轩,烨华,晓博,博简,斯伯,和平,轮,璞瑜,杰,景同,绍钧,兴平,锐智,飞沉,建本,乐心,佺,孺,轼,天睿,松,明诚,智勇,凯定,宁,征,高轩,明远,阳荣,侃,宏放,成龙,靖琪,守,建弼,弘厚,辉,高杰,律,宋,融,泰平,乐志,俊明,宏,瑾瑜,煜祺,辑,涵亮,宗,龙,翔飞,玚,羚,澜,明珠,实,建华,安易,康宁,御,群,弘毅,嘉颖,学义,宪,玮,成双,彭越,莱,段,嘉悦,德,光远,容,文瑞,彭薄,宽,羽,勇军,达,新荣,菁,心,朋兴,毅,密,翰采,雅懿,博远,伟茂,俊才,俊,坚诚,友,富,信厚,高原,叔,诗,奇逸,进,浩瀚,光耀,保,俟,忠,鹏池,矢,俣,鸿晖,敏博,天韵,高寒,韩,康德,永贞,俊驰,景山,濮,修,濯,峻熙,俊誉,建德,阳羽,俊智,基,敏学,鸿才,俊艾,宜民";
    private static final String GIRL_NAME = "韦茹,婉然,宇芳,月明,秀秀,菀菀,怀思,芸莹,白曼,雪冰,碧菡,怜,山晴,爱琴,傲芙,倰,菊芬,夏彤,偀,静和,桂,问梅,俏丽,梦琪,端敏,忆彤,妃妍,巧兰,诗兰,聪,火,蕙芸,偲,灵,小芬,莹洁,雅云,怡和,炅,梅,思洁,雅隽,蕴美,紫桐,萦怀,炎,晓瑶,清一,忻然,逸秀,古韵,颜,悦,梦,凝雪,香露,炫,逸致,育,芳洁,情,幻翠,旦娅,谷丝,琳溪,绿柳,雨花,惜,烟,妙彤,嘉淑,叶春,寻文,安卉,婉娜,丽美,迎曼,晓洁,月朗,仪芳,安荷,蓓莉,山彤,雁枫,书芹,梦泽,以南,苏娟,幻桃,新烟,雅静,冰蓝,蓉蓉,恬谧,允,莞然,蓉洁,绮艳,佩玉,旭妍,淑哲,立芬,凡霜,熙柔,子芸,慧,雨筠,仲舒,洋洋,燕肖,兰,荏苒,女,奴,问香,好,晴照,寻春,妃,以寒,妆,娆苒,思嘉,冉,柔绚,友菱,妍,佩珍,瑞娟,向莉,映容,寄波,雅辰,香,乐巧,歆琳,海桃,熙怡,馨,妍妍,梓柔,冬,银柳,冰,冷,妹,倚云,秀,芳春,雅韵,珉瑶,白梦,青雪,思丽,明明,惜霜,姐,姑,燕,姜,冰薇,凝,姝,飞雪,乐丹,凡,亦寒,乃心,姬,慧晨,姯,凰,瑞芝,姲,姳,莹白,姹,尔安,姿,芷巧,小谷,青木,新妹,娆,柔静,小萱,娉,紫槐,韶华,素欣,洲裴,舒,娘,娜,贝莉,紫凝,娟,以山,晓丝,晓昕,尔容,弘丽,笑笑,琴音,爱,媛女,娴,月桃,靖雁,平婉,怡乐,真文,启颜,思雁,语梦,婉,氷羙,碧春,灵萱,婕,依晨,津童,梓颖,冬云,艳,恺玲,洁静,希月,婷,艺,文霞,佳莉,朝旭,梓悦,听然,书萱,水桃,芃,凡桃,迎梦,芊,韶容,浅伽,初夏,媚,婉容,媛,妙意,芝,柔怀,惠美,贝琳,蝾婷,婷丽,芮,芯,媱,花,初然,芳,芸,丹秋,曼婉,诗珊,嫂,国娟,听兰,映波,哲妍,苑,嫔,八雪,知世,语儿,嫣,勤,晏静,嫦,燕舞,恨之,媛娜,甘泽,凡梦,端,欣秀,嫱,英,卿云,苹,竹,思佳,柯洁,庄夏,梅英,辰蓉,翠绿,文心,笑萍,施然,水风,茗,海冬,娴雅,茜,安蕾,竹月,思枫,欢,欣,慕凝,雅楠,雍恬,梦月,慧心,沈雅,蓝瑟,雯琴,子璇,晨钰,静美,怜翠,草,华,爰美,之桃,昊怡,姝妍,谷梦,秋双,西贝,琼思,和暄,荷,乐心,卿,宁,怀玉,冰露,雅秀,玉,莉,凌珍,莎,晶茹,代丝,莓,梦松,宛,宜,国英,玟,淑静,舒玉,玫,迎秋,娴静,雅凡,沛蓝,环,芸静,流惠,璠瑜,莲,斯玉,萌阳,莹,莺,欣艳,菀,颖馨,菁,沈靖,冷亦,帮琼,臻晰,珆,千亦,菊,珊,珍,寒,傲之,毓,展文,冷雁,珠,思聪,天音,琳秀,芝英,佳洁,梦柏,水香,凌萱,可,珴,叶,颖秀,瑜蓓,小春,姣妍,慧颖,傲晴,紫寒,萍,润洁,瑛蔓,君,珍丽,虹玉,琦,琬,琰,曼容,萱,琳,琴,水,丹南,子薇,念薇,生文,滢滢,屏,萧玉,安雁,琳爰,斯琪,瑗,远悦,呤,水舞,云飞,曼珠,紫萱,清秋,瑶,向晨,暄婷,优悠,沁,幼安,璇,彤彤,晓灵,咏,璐,世韵,天悦,钗,睿琳,岚,咛,凌波,瑜文,林楠,曼吟,钰,夏菡,平蓝,忆寒,蓉,晶瑶,暄嫣,暖梦,蓝,甘雨,叶舞,书云,波,芊丽,三姗,半雪,韶阳,秀隽,银,瓶,列琴,柔婉,盼山,念之,梓欣,英秀,朵薇,洁,傲松,玉轩,蔓,逸丽,海莲,嘉懿,彩静,灵雨,贞,素,贤,流婉,慕诗,春雁,瑰玮,依然,丝微,怡然,画,琨瑶,芙蓉,芳馥,半青,夏山,奕叶,蕊,书仪,夏璇,光文,嵘,润丽,睿哲,忆山,盼波,林娜,春雪,修美,菱华,雨彤,华月,雅安,祖萍,向彤,妙可,梓玥,文,薇,君丽,夏河,斐,霞飞,轶丽,涟,宁夏,悠婉,薰,紫文,紫薇,斯文,涵,醉易,雪青,忻乐,雅寒,新蕾,念真,恨天,灵枫,淞,惠芳,芸馨,巧,尤文,芸熙,琰琬,娅彤,雨柏,隽洁,梦凡,淼,雪羽,静婉,珂妍,清,惜筠,爰爰,婧玟,听蓉,育梅,丝,星,谷玉,绿蕊,春,家欣,春枫,芸姝,丹,渺,春柔,鹃,晴丽,春柏,韶美,和煦,西柠,应艳,春翠,嘉歆,痴旋,雪柳,紫丝,优扬,乐芸,馨欣,瑶琴,音韵,静芙,平,晴,念柏,晶,虹,怡婷,湾,喜悦,问雁,庄,芮安,谷菱,秋月,赞怡,之玉,夏旋,亚,丰雅,红,纤,馨荣,纨,觅翠,曲静,纯,南露,鹤梅,娅思,洛灵,悦媛,纹,孟阳,亿,线,雁,连英,雅,思卉,新晴,盈,伶伶,彦慧,晶晶,伟娜,黛,绛,甜恬,半烟,滟,绮思,囡,滢,丽文,绣,今瑶,雨,雪,仪,雯,芳茵,卷玉,曼,晴曦,绿,映天,梅雪,月,眉,慕涵,紫雪,霓,若蕊,霖,苏迷,炜琳,霜,霞,寒梦,真,凌蝶,纪颖,慧玲,松雨,缨,漩,霭,莹莹,凝海,旭辉,悦欣,新雪,阳霁,淳雅,会欣,潇,羽彤,盼雁,湘媛,青,新月,妙旋,翠茵,紫霞,紫霜,梅青,晓筠,彤,彨,妮子,轩,秋柏,雁丝,影,佳,思菱,怀蝶,香巧,瑾萱,正平,之瑶,半香,珠轩,雪儿,七锦,天玉,冬莲,融,盼盼,美,艳玲,寻琴,林,晓莉,佳悦,澜,依,枝,虹雨,涵雁,柔洁,青蓉,小凝,熙星,枫,含景,从蓉,蓉华,安娜,羽,书兰,心,白亦,书慧,云水,吟怀,巧风,漾漾,碧玉,冬菱,添智,问柳,瑞灵,翠玲,从波,俞,蝶梦,元风,谷蕊,芷珊,俪,琳涵,渲染,可嘉,音,念,韵,海云";
    private static final Random RANDOM = new Random();

    /**
     * 获取中文姓名
     *
     * @param boy 是否是男姓名
     * @return 姓名
     */
    public static String getChineseName(boolean boy) {
        int i = RANDOM.nextInt(SUR_NAME.split(",").length);
        String prefix = SUR_NAME.split(",")[i];
        String suffix;
        if (boy) {
            i = RANDOM.nextInt(BOY_NAME.split(",").length);
            suffix = BOY_NAME.split(",")[i];
        } else {
            i = RANDOM.nextInt(GIRL_NAME.split(",").length);
            suffix = GIRL_NAME.split(",")[i];
        }
        return prefix + suffix;
    }

    /**
     * 随机生成姓名
     * @return 姓名
     */
    public static String getChineseName() {
        return getChineseName(RANDOM.nextBoolean());
    }

    /**
     * 随机生成性别
     *
     * @return 0:女  1:男
     */
    public static int getSex() {
        return RANDOM.nextInt(2);
    }

    /**
     * 随机生成在区间内的年龄
     * @param startAge 开始年龄
     * @param endAge 结束年龄
     * @return 年龄
     */
    public static int getAge(int startAge,int endAge){
        if (startAge < 0 || endAge < 0){
            throw new IndexOutOfBoundsException("年龄需要在合理的区间内");
        }
        if(startAge > endAge){
            throw new IndexOutOfBoundsException("起始年龄不能大于结束年龄");
        }
        int age = RANDOM.nextInt(endAge + 1);
        while (age < startAge){
            age = RANDOM.nextInt(endAge + 1);
        }
        return age;
    }

}
